--------------------------------------------------------------------------------
Makelog started: 2022-12-14 09:57:43
Working directory: /Users/conniexu/Documents/Harvard/research projects/Nursing-Homes/hcris_sum_stats/code
--------------------------------------------------------------------------------
External links successfully created!

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core network, expiring 30 Jun 2023
Serial number: 501709311471
  Licensed to: Harvard University
               Harvard University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do "/Users/conniexu/Documents/Harvard/research projects/Nursing-Homes/hcris_s
> um_stats/code/build.do" 

. set more off

. clear all

. capture log close

. program drop _all

. set scheme modern

. preliminaries

. version 17

. set maxvar 120000, perm
(set maxvar preference recorded)


. 
. program main   
  1.     sum_wages
  2. end

. 
. program sum_wages 
  1.     import delimited using "../external/samp/SNF10_2016_NMRC.CSV", clear 
  2.     keep if v2 == "S300005"
  3.     keep if v4 == "00500"
  4.     keep if inlist(v3, 100, 200, 300)
  5.     foreach v in 100 200 300 {
  6.         qui sum v5 if v3 == `v', d 
  7.         local p99_`v' = r(p99)
  8.         sum v5 if v3 == `v' &  v5 <= `p99_`v'', d 
  9.         local mean_`v' = round(r(mean), 0.01)
 10.         local med_`v' = round(r(p50), 0.01)
 11.     }
 12. 
.     tw hist v5 if v3 == 100 & v5 <= `p99_100', frac color(lavender%40) xline(`mean_100', lcolor(black) lpattern(dash)) || ///
>        hist v5 if v3 == 200 &  v5 <= `p99_200', frac color(emerald%40) xline(`mean_200', lcolor(black) lpattern(dash)) || ///
>        hist v5 if v3 == 300 &  v5 <= `p99_300', frac color(navy%40)  xline(`mean_300', lcolor(black) lpattern(dash)) ///
>        ytitle("Fraction of Nursing Homes") xtitle("Hourly Wage") xlabel(0(10)80) legend(on label(1 "RN avg. wage = `mean_100'") ///
>                                         label(2 "LPN avg. wage = `mean_200'") ///
>                                         label(3 "CNA avg. wage = `med_300'") pos(1) ring(0) region(lwidth(none))) 
 13.     graph export ../output/figures/wage.eps, replace
 14. end

. 
. main
file ../external/samp/SNF10_2016_NMRC.CSV not found
r(601);

end of do-file
r(601);

