--------------------------------------------------------------------------------
Makelog started: 2022-12-06 18:48:37
Working directory: /Users/conniexu/Documents/Harvard/research projects/Nursing-Homes/hcris_sum_stats/code
--------------------------------------------------------------------------------
External links successfully created!

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core network, expiring 30 Jun 2023
Serial number: 501709311471
  Licensed to: Harvard University
               Harvard University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do "/Users/conniexu/Documents/Harvard/research projects/Nursing-Homes/hcris_s
> um_stats/code/build.do" 

. set more off

. clear all

. capture log close

. program drop _all

. set scheme modern

. preliminaries

. version 17

. set maxvar 120000, perm
(set maxvar preference recorded)


. 
. program main   
  1.     sum_wages
  2. end

. 
. program sum_wages 
  1.     import delimited using "../external/samp/SNF10_2016_NMRC.CSV", clear 
  2.     keep if v2 == "S300005"
  3.     keep if v4 == "00500"
  4.     keep if inlist(v3, 100, 200, 300)
  5.     tw hist v5 if v3 == 100 || hist v5 if v3 = 200 || hist v5 if v3 == 300
  6.     graph export ../output/figures/wage.pdf
  7. end

. 
. main
(encoding automatically selected: ISO-8859-2)
(5 vars, 14,713,086 obs)
(14,143,420 observations deleted)
(441,531 observations deleted)
(84,876 observations deleted)
invalid syntax
r(198);

end of do-file
r(198);

